package JavaEE7JPA;
//ORM  https://ru.wikipedia.org/wiki/ORM
//JPA  https://uk.wikipedia.org/wiki/Java_Persistence_API

//ORM (англ. Object-relational mapping, Об'єктно-реляційна проекція) — технологія програмування, яка зв'язує бази даних з концепціями
// об'єктно-орієнтованих мов програмування, створюючи «віртуальну об'єктну базу даних».

//JPA (Java Persistence API)  в загальному це така технологія яка являє собою стандартизований інтерфейс або унівесальний інструмент для роботи
// з різнми ORM базами даних. Бази даних в загальному побудовані і функціонують однаково але якщо працювати з базою даних через код java  кожна
// з них має дещо інші команди і для реалізації будь яких дій в базі даних потрібно багато коду тому виник JPA інструмент через який можна
// стандартизовано працювати з  різними базами даних через інтерфейс JPA

public class JPA1Begin {
}
